<script setup lang="ts">
  import CaseHeroSection from '~/components/case/CaseHeroSection.vue'
  import SubscribeNewsletter from '~/components/SubscribeNewsletter.vue'
  import { useRoute } from '#imports'
  import CaseBodySection from '~/components/case/CaseBodySection.vue'
  import CaseGallerySection from '~/components/case/CaseGallerySection.vue'

  const route = useRoute()
  const slug = route.params.slug as string
  const cases = {
    'remont-1': {
      heroSection: {
        title: 'Ремонт №1',
        image: {
          src: '/images/case/case1.png',
          alt: 'case1'
        },
        description: 'Татьня Олеговна (63 года) и Тимур Папиушвилли (72 года)'
      },
      bodySection: {
        title: 'Чем мы помогли?',
        text:
          'Программа "Купить еды" работает по принципу сбора пожертвований от добровольцев, которые затем используются для покупки еды для нуждающихся людей. Средства могут быть использованы для покупки продуктов питания или семян для выращивания собственной пищи в рамках устойчивого сельского хозяйства.</br></br>' +
          'Эта благотворительная программа работает в тесном партнерстве с местными организациями, такими как приюты для бездомных, церкви, некоммерческие организации и общественные фонды. Они предоставляют информацию о семьях и отдельных людях, которым необходима помощь, и координируют доставку продуктов до их дверей. Благодаря программе "Купить еды" у голодающих людей есть возможность получить достойное питание, которое позволяет им сохранять здоровье и продуктивность. Это также позволяет семьям сэкономить средства на покупке еды, которые могут быть использованы для других потребностей, таких как образование, медицинская помощь или жилище.</br></br>' +
          'Важной особенностью этой программы является прозрачность использования пожертвований. Добровольцы могут быть уверены, что их пожертвования будут использованы эффективно и надлежащим образом, чтобы помочь тем, кто в действительности нуждается в поддержке.'
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png',
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png'
        ]
      }
    },
    'remont-2': {
      heroSection: {
        title: 'Ремонт №2',
        image: {
          src: '/images/case/case1.png',
          alt: 'case2'
        },
        description: 'Татьня Олеговна (63 года) и Тимур Папиушвилли (72 года)'
      },
      bodySection: {
        title: 'Чем мы помогли?',
        text:
          'Программа "Купить еды" работает по принципу сбора пожертвований от добровольцев, которые затем используются для покупки еды для нуждающихся людей. Средства могут быть использованы для покупки продуктов питания или семян для выращивания собственной пищи в рамках устойчивого сельского хозяйства.</br></br>' +
          'Эта благотворительная программа работает в тесном партнерстве с местными организациями, такими как приюты для бездомных, церкви, некоммерческие организации и общественные фонды. Они предоставляют информацию о семьях и отдельных людях, которым необходима помощь, и координируют доставку продуктов до их дверей. Благодаря программе "Купить еды" у голодающих людей есть возможность получить достойное питание, которое позволяет им сохранять здоровье и продуктивность. Это также позволяет семьям сэкономить средства на покупке еды, которые могут быть использованы для других потребностей, таких как образование, медицинская помощь или жилище.</br></br>' +
          'Важной особенностью этой программы является прозрачность использования пожертвований. Добровольцы могут быть уверены, что их пожертвования будут использованы эффективно и надлежащим образом, чтобы помочь тем, кто в действительности нуждается в поддержке.'
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png',
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png'
        ]
      }
    },
    'remont-3': {
      heroSection: {
        title: 'Ремонт №3',
        image: {
          src: '/images/case/case1.png',
          alt: 'case2'
        },
        description: 'Татьня Олеговна (63 года) и Тимур Папиушвилли (72 года)'
      },
      bodySection: {
        title: 'Чем мы помогли?',
        text:
          'Программа "Купить еды" работает по принципу сбора пожертвований от добровольцев, которые затем используются для покупки еды для нуждающихся людей. Средства могут быть использованы для покупки продуктов питания или семян для выращивания собственной пищи в рамках устойчивого сельского хозяйства.</br></br>' +
          'Эта благотворительная программа работает в тесном партнерстве с местными организациями, такими как приюты для бездомных, церкви, некоммерческие организации и общественные фонды. Они предоставляют информацию о семьях и отдельных людях, которым необходима помощь, и координируют доставку продуктов до их дверей. Благодаря программе "Купить еды" у голодающих людей есть возможность получить достойное питание, которое позволяет им сохранять здоровье и продуктивность. Это также позволяет семьям сэкономить средства на покупке еды, которые могут быть использованы для других потребностей, таких как образование, медицинская помощь или жилище.</br></br>' +
          'Важной особенностью этой программы является прозрачность использования пожертвований. Добровольцы могут быть уверены, что их пожертвования будут использованы эффективно и надлежащим образом, чтобы помочь тем, кто в действительности нуждается в поддержке.'
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png',
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png'
        ]
      }
    },
    'remont-4': {
      heroSection: {
        title: 'Ремонт №4',
        image: {
          src: '/images/case/case1.png',
          alt: 'case2'
        },
        description: 'Татьня Олеговна (63 года) и Тимур Папиушвилли (72 года)'
      },
      bodySection: {
        title: 'Чем мы помогли?',
        text:
          'Программа "Купить еды" работает по принципу сбора пожертвований от добровольцев, которые затем используются для покупки еды для нуждающихся людей. Средства могут быть использованы для покупки продуктов питания или семян для выращивания собственной пищи в рамках устойчивого сельского хозяйства.</br></br>' +
          'Эта благотворительная программа работает в тесном партнерстве с местными организациями, такими как приюты для бездомных, церкви, некоммерческие организации и общественные фонды. Они предоставляют информацию о семьях и отдельных людях, которым необходима помощь, и координируют доставку продуктов до их дверей. Благодаря программе "Купить еды" у голодающих людей есть возможность получить достойное питание, которое позволяет им сохранять здоровье и продуктивность. Это также позволяет семьям сэкономить средства на покупке еды, которые могут быть использованы для других потребностей, таких как образование, медицинская помощь или жилище.</br></br>' +
          'Важной особенностью этой программы является прозрачность использования пожертвований. Добровольцы могут быть уверены, что их пожертвования будут использованы эффективно и надлежащим образом, чтобы помочь тем, кто в действительности нуждается в поддержке.'
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png',
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png'
        ]
      }
    },
    'remont-5': {
      heroSection: {
        title: 'Ремонт №5',
        image: {
          src: '/images/case/case1.png',
          alt: 'case2'
        },
        description: 'Татьня Олеговна (63 года) и Тимур Папиушвилли (72 года)'
      },
      bodySection: {
        title: 'Чем мы помогли?',
        text:
          'Программа "Купить еды" работает по принципу сбора пожертвований от добровольцев, которые затем используются для покупки еды для нуждающихся людей. Средства могут быть использованы для покупки продуктов питания или семян для выращивания собственной пищи в рамках устойчивого сельского хозяйства.</br></br>' +
          'Эта благотворительная программа работает в тесном партнерстве с местными организациями, такими как приюты для бездомных, церкви, некоммерческие организации и общественные фонды. Они предоставляют информацию о семьях и отдельных людях, которым необходима помощь, и координируют доставку продуктов до их дверей. Благодаря программе "Купить еды" у голодающих людей есть возможность получить достойное питание, которое позволяет им сохранять здоровье и продуктивность. Это также позволяет семьям сэкономить средства на покупке еды, которые могут быть использованы для других потребностей, таких как образование, медицинская помощь или жилище.</br></br>' +
          'Важной особенностью этой программы является прозрачность использования пожертвований. Добровольцы могут быть уверены, что их пожертвования будут использованы эффективно и надлежащим образом, чтобы помочь тем, кто в действительности нуждается в поддержке.'
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png',
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png'
        ]
      }
    },
    'remont-6': {
      heroSection: {
        title: 'Ремонт №6',
        image: {
          src: '/images/case/case1.png',
          alt: 'case2'
        },
        description: 'Татьня Олеговна (63 года) и Тимур Папиушвилли (72 года)'
      },
      bodySection: {
        title: 'Чем мы помогли?',
        text:
          'Программа "Купить еды" работает по принципу сбора пожертвований от добровольцев, которые затем используются для покупки еды для нуждающихся людей. Средства могут быть использованы для покупки продуктов питания или семян для выращивания собственной пищи в рамках устойчивого сельского хозяйства.</br></br>' +
          'Эта благотворительная программа работает в тесном партнерстве с местными организациями, такими как приюты для бездомных, церкви, некоммерческие организации и общественные фонды. Они предоставляют информацию о семьях и отдельных людях, которым необходима помощь, и координируют доставку продуктов до их дверей. Благодаря программе "Купить еды" у голодающих людей есть возможность получить достойное питание, которое позволяет им сохранять здоровье и продуктивность. Это также позволяет семьям сэкономить средства на покупке еды, которые могут быть использованы для других потребностей, таких как образование, медицинская помощь или жилище.</br></br>' +
          'Важной особенностью этой программы является прозрачность использования пожертвований. Добровольцы могут быть уверены, что их пожертвования будут использованы эффективно и надлежащим образом, чтобы помочь тем, кто в действительности нуждается в поддержке.'
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png',
          '/images/case/case-image1.png',
          '/images/case/case-image2.png',
          '/images/case/case-image3.png'
        ]
      }
    },
    'psy-klimentevo': {
      heroSection: {
        title: 'Уютная старость №1',
        image: {
          src: '/images/case/cozy-old-age/case1.png',
          alt: 'case2'
        },
        description:
          'Ремонт прачечной в отделении сестринского ухода при Клементьевской участковой больнице.'
      },
      bodySection: {
        title: 'Чем мы помогли?',
        text:
          'В отделении на постоянной основе проживает ~25 человек из них 85% это маломобильные люди, прикованные к кроватям.За ними нужен специальный уход, постоянные гигиенические процедуры, обработка пролежней и прочее. </br></br>' +
          'Количество белья в день, которое надо постирать, высушить и погладить около 60 кг.Весь этот процесс лежит на хрупких плечах Светланы Николаевны, которая ежедневно работала в неблагоприятных условиях, но благодаря которой в отделении совершенно отсутствует специфический запах, характерный для подобных мест.Это огромная и очень важная часть бесперебойного процесса работы отделения и очень важная часть для поддержания чистоты и достойных условий проживания бабушек и дедушек.<br><br>' +
          'За 26 лет прачечную ни разу не ремонтировали,но мы исправили это с вашей помощью! Этот ремонт был нашей мечтой много лет.С первого приезда в учреждение мы четко решили, что улучшим качество проживания бабушек и дедушек, а так же условия работы сотрудников.<br><br>' +
          'Сегодня у нас полностью отремонтированные палаты, столовая, пищеблок,ванные комнаты, коридоры, которые оборудованы по стандартам доступной среды и обновленная прачечная, в которой ежедневно стирают и гладят белье и одежду.<br><br>' +
          'Спасибо другу Фонда, который полностью помог закрыть сбор на ремонт и осуществил нашу общую большую мечту!<br><br>'
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/cozy-old-age/image1.png',
          '/images/case/cozy-old-age/image2.png',
          '/images/case/cozy-old-age/image3.png',
          '/images/case/cozy-old-age/image4.png',
          '/images/case/cozy-old-age/image5.png',
          '/images/case/cozy-old-age/image6.png',
          '/images/case/cozy-old-age/image7.png',
          '/images/case/cozy-old-age/image8.png',
          '/images/case/cozy-old-age/image9.png',
          '/images/case/cozy-old-age/image10.png'
        ]
      }
    },
    'rzhevskij-dom-internat': {
      heroSection: {
        title: 'Пожилым людям №1',
        image: {
          src: '/images/case/rzhevskij-dom-internat.png',
          alt: 'case2'
        },
        description: ''
      },
      bodySection: {
        title: '',
        text: ''
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/rzhevskij-dom-internat/image1.png',
          '/images/case/rzhevskij-dom-internat/image2.png',
          '/images/case/rzhevskij-dom-internat/image3.png',
          '/images/case/rzhevskij-dom-internat/image4.png'
        ]
      }
    },
    'psy-klimentevo-2': {
      heroSection: {
        title: 'Пожилым людям №2',
        image: {
          src: '/images/case/cozy-old-age/case1.png',
          alt: 'case2'
        },
        description: ''
      },
      bodySection: {
        title: '',
        text: ''
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/cozy-old-age/image1.png',
          '/images/case/cozy-old-age/image2.png',
          '/images/case/cozy-old-age/image3.png',
          '/images/case/cozy-old-age/image4.png',
          '/images/case/cozy-old-age/image5.png',
          '/images/case/cozy-old-age/image6.png',
          '/images/case/cozy-old-age/image7.png',
          '/images/case/cozy-old-age/image8.png',
          '/images/case/cozy-old-age/image9.png',
          '/images/case/cozy-old-age/image10.png'
        ]
      }
    },
    bereginya: {
      heroSection: {
        title: 'Пожилым людям №3',
        image: {
          src: '/images/case/bereginya.png',
          alt: 'case2'
        },
        description: ''
      },
      bodySection: {
        title: '',
        text: ''
      },
      gallerySection: {
        title: 'Галерея',
        images: [
          '/images/case/bereginya/image1.png',
          '/images/case/bereginya/image2.png',
          '/images/case/bereginya/image3.png'
        ]
      }
    }
  }

  const currentCase = cases[slug]
</script>

<template>
  <main class="case">
    <case-hero-section :settings="currentCase.heroSection" />
    <case-body-section :settings="currentCase.bodySection" class="body-section" />
    <case-gallery-section :settings="currentCase.gallerySection" class="gallery-section" />
    <subscribe-newsletter class="subscribe-section" />
  </main>
</template>

<style scoped lang="scss">
  .case {
    padding-block: 50px 150px;

    @media screen and (min-width: $breakpoint-lg) {
      padding-block: 100px 200px;
    }

    .body-section {
      margin-top: 100px;

      @media screen and (min-width: $breakpoint-lg) {
        margin-top: 160px;
      }
    }

    .gallery-section {
      margin-top: 130px;
    }

    .subscribe-section {
      margin-top: 100px;

      @media screen and (min-width: $breakpoint-lg) {
        margin-top: 200px;
      }
    }
  }
</style>
