<script lang="ts" setup></script>

<template>
  <div class="privacy-policy">
    <div class="container">
      <h1 class="privacy-policy__title">Пользовательское соглашение</h1>
      <div class="privacy-policy__content">
        Настоящее Соглашение определяет условия использования Пользователями материалов и сервисов
        сайта
        <a
          href="http://cocodobrando.com/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          ><span style="font-weight: 500"
            ><span data-redactor-style="font-size: 18px;" style="font-size: 18px"
              >www.darinadezhdu.org</span
            ></span
          ></a
        ><br /><br /><strong>1.Общие условия</strong><br /><br />1.1. Использование материалов и
        сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.<br /><br />1.2.
        Настоящее Соглашение является публичной офертой. Получая доступ к материалам Сайта
        Пользователь считается присоединившимся к настоящему Соглашению.<br /><br />1.3.
        Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего
        Соглашения. Такие изменения вступают в силу по истечении 3 (Трех) дней с момента размещения
        новой версии Соглашения на сайте. При несогласии Пользователя с внесенными изменениями он
        обязан отказаться от доступа к Сайту, прекратить использование материалов и сервисов
        Сайта.<br /><br /><strong>2. Обязательства Пользователя</strong><br /><br />2.1.
        Пользователь соглашается не предпринимать действий, которые могут рассматриваться как
        нарушающие российское законодательство или нормы международного права, в том числе в сфере
        <a
          href="http://copyright.ru/intellectual/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >интеллектуальной собственности</a
        >,
        <a
          href="http://copyright.ru/ru/documents/avtorskoe_pravo/avtorskie_prava/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >авторских</a
        >
        и/или
        <a
          href="http://copyright.ru/ru/documents/avtorskoe_pravo/smegnie_prava/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >смежных правах</a
        >, а также любых действий, которые приводят или могут привести к нарушению нормальной работы
        Сайта и сервисов Сайта.<br /><br />2.2. Использование материалов Сайта без согласия
        <a
          href="http://copyright.ru/documents/avtorskoe_pravo/pravoobladateli/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >правообладателей</a
        >
        не допускается (статья 1270 Г.К РФ). Для правомерного использования материалов Сайта
        необходимо заключение
        <a
          href="http://copyright.ru/ru/documents/avtorskoe_pravo/peredacha_avtorskih_prav/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >лицензионных договоров</a
        >
        (получение лицензий) от Правообладателей.<br /><br />2.3. При
        <a
          href="http://copyright.ru/library/zakonodatelstvo/gk_rf_obschee_zakonodatel/grazhdanskii_kodeks_RF_4_chast/glava_70__avtorskoe_pravo/#20"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >цитировании</a
        >
        материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна
        (подпункт 1 пункта 1 статьи 1274 Г.К РФ).<br /><br />2.4. Комментарии и иные записи
        Пользователя на Сайте не должны вступать в противоречие с требованиями законодательства
        Российской Федерации и общепринятых норм морали и нравственности.<br /><br />2.5.
        Пользователь предупрежден о том, что Администрация Сайта не несет ответственности за
        посещение и использование им внешних ресурсов, ссылки на которые могут содержаться на
        сайте.<br /><br />2.6. Пользователь согласен с тем, что Администрация Сайта не несет
        ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с
        любыми возможными или возникшими потерями или убытками, связанными с любым содержанием
        Сайта,
        <a
          href="http://copyright.ru/ru/documents/registraciy_avtorskih_prav/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >регистрацией авторских прав</a
        >
        и сведениями о такой регистрации, товарами или услугами, доступными на или полученными через
        внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя
        размещенную на Сайте информацию или ссылки на внешние ресурсы.<br /><br />2.7. Пользователь
        принимает положение о том, что все материалы и сервисы Сайта или любая их часть могут
        сопровождаться рекламой. Пользователь согласен с тем, что Администрация Сайта не несет
        какой-либо ответственности и не имеет каких-либо обязательств в связи с такой рекламой.<br /><br /><strong
          >3. Прочие условия</strong
        ><br /><br />3.1. Все возможные споры, вытекающие из настоящего Соглашения или связанные с
        ним, подлежат разрешению в соответствии с действующим законодательством Российской
        Федерации.<br /><br />3.2. Ничто в Соглашении не может пониматься как установление между
        Пользователем и Администрации Сайта агентских отношений, отношений товарищества, отношений
        по совместной деятельности, отношений личного найма, либо каких-то иных отношений, прямо не
        предусмотренных Соглашением.<br /><br />3.3. Признание судом какого-либо положения
        Соглашения недействительным или не подлежащим принудительному исполнению не влечет
        недействительности иных положений Соглашения.<br /><br />3.4. Бездействие со стороны
        Администрации Сайта в случае нарушения кем-либо из Пользователей положений Соглашения не
        лишает Администрацию Сайта права предпринять позднее соответствующие действия в защиту своих
        интересов и
        <a
          href="http://copyright.ru/documents/zashita_avtorskih_prav/"
          style="font-family: HelveticaNeue, Arial, sans-serif; font-size: 20px"
          >защиту авторских прав</a
        >
        на охраняемые в соответствии с законодательством материалы Сайта.<br /><br /><strong
          >Пользователь подтверждает, что ознакомлен со всеми пунктами настоящего Соглашения и
          безусловно принимает их.</strong
        >
      </div>
    </div>
  </div>
</template>

<style lang="scss" scoped>
  .privacy-policy {
    padding-bottom: 20px;

    @media screen and (min-width: $breakpoint-md) {
      padding-bottom: 40px;
    }
    @media screen and (min-width: $breakpoint-lg) {
      padding-bottom: 100px;
    }
    &__content {
      margin-top: 20px;
    }
  }
</style>
